use lab;
-- Insert into Departments
INSERT INTO Departaments (DepTtl, ProjID)
VALUES
('Отдел биохимических исследований', 1),
('Отдел молекулярной биологии', 2),
('Отдел генетических исследований', 3),
('Отдел нанотехнологий и материаловедения', 4),
('Отдел клинических испытаний и фармакологии', 5),
('Отдел экологических исследований', 6),
('Отдел психологических и социологических исследований', 7),
('Отдел инженерии и разработки', 8),
('Отдел физики и астрономии', 9),
('Отдел информационных технологий и компьютерных наук', 10),
('Отдел пищевых технологий и агрономии', 11);

-- Insert into Users (Employee)
INSERT INTO Users (Login, Permission, FirstName, Surname, LastName, Gender, Birthday, FamilyStatus, HavingChildren, JobTitle, AcademicDegree, DepID, WorkExperience, Salary, PhoneNumber, Email)
VALUES 
('nikolai', 'user', 'Николай', 'Романович', 'Шебалков', 'M', '2005-08-25', 'Холост', 0, 'Лаборант', 'Кандидат наук', 1, 10, 100000, '1234567890', 'lolkek.doe@example.com'),
('alexander', 'user', 'Александр', 'Павлович', 'Наумов', 'M', '2006-08-29', 'В активном поиске', 1, 'Уборщик', 'Образование отсутствует', 1, 13, 19242, '9876543210', 'kekcheberek.doe@example.com'),
('sergei', 'user', 'Сергей', 'Сергеевич', 'Степцов', 'M', '2006-06-18', 'Холост', 0, 'Лаборант', 'Бакалавр', 1, 3, 44000, '5556667777', 'michael.smith@example.com'),
('vasiliy', 'user', 'Василий', 'Витальевич', 'Блохин', 'M', '1985-05-17', 'Разведён', 5, 'Профессор', 'Доктор наук', 2, 10, 150000, '4443332222', 'emily.jones@example.com'),
('matvey', 'user', 'Матвей', 'Павлович', 'Самойличенко', 'M', '2003-08-12', 'Разведён', 0, 'Уборщик', 'Среднее профессиональное орбазование', 2, 8, 70000, '3335555444', 'garrys.mod@ksuf.com'),
('dmitry', 'user', 'Дмитрий', 'Павлович', 'Шабанов', 'M', '2004-08-15', 'Холост', 0, 'Инженер', 'Среднее профессиональное орбазование', 2, 4, 90000, '8005553535', 'burila.skvazhin@skuf.com'),
('vladislav', 'user', 'Владислав', 'Витальевич', 'Морозов', 'M', '2008-02-17', 'Холост', 0, 'Лаборант', 'Основное общее образование', 3, 2, 30000, '7777777777', 'skufazavr777@skuf.ru'),
('miron', 'user', 'Мирон', 'Максимович', 'Воронин', 'M', '2009-12-18', 'Холост', 0, 'Электрик', 'Основное общее образование', 3, 0, 10000, '3046708436', 'sgbdboujndfh@skuf.com'),
('vyacheslav', 'user', 'Вячеслав', 'Романович', 'Иванов', 'M', '1999-10-13', 'Женат', 3, 'Профессор', 'Образование отсутствует', 3, 6, 25000, '5774557458', 'bsdjbjbd@skuf.com'),
('kristina', 'user', 'Кристина', 'Витальевна', 'Ивичук', 'Ж', '2007-01-12', 'Вдова', 0, 'Химик', 'Аспирант', 4, 1, 15000, '4373657868', 'nsd57kjnljxn@skuf.com'),
('vladislav2', 'user', 'Владислав', 'Александрович', 'Воробьёв', 'M', '2006-12-24', 'Женат', 0, 'Администратор', 'Бакалавр', 5, 2, 65000, '5377677658', 'sgfjmghmmcyh@skuf.com'),
('artyom', 'user', 'Артём', 'Витальевич', 'Шум', 'M', '2006-08-14', 'Женат', 2, 'Физик', 'Бакалавр', 5, 3, 55000, '4764536864', 'sdhgdkhv@skuf.com'),
('igor', 'admin', 'Игорь', 'Андреевич', 'Веденеев', 'M', '2006-10-14', 'Холост', 0, 'Физик', 'Аспирант', 5, 4, 75000, '43636876979', 'minecraftik@skuf.com'),
('aleksey', 'user', 'Алексей', 'Павлович', 'Пасечников', 'M', '2003-05-04', 'Холост', 0, 'Химик', 'Аспирант', 6, 2, 75000, '47697898870', 'xgfjnncx@gmail.com'),
('dmitry2', 'user', 'Дмитрий', 'Владимирович', 'Лукьянов', 'M', '2007-05-13', 'Холост', 0, 'Лаборант', 'Аспирант', 6, 1, 65000, '58757484679', 'vvvvvsdvfds@mail.ru'),
('kirill', 'user', 'Кирилл', 'Иванович', 'Назаров', 'M', '2007-01-09', 'Женат', 0, 'Лаборант', 'Аспирант', 6, 0, 55000, '54765876989', 'dsgsdgs@mail.com'),
('nurdil', 'user', 'Нурадиль', 'Азаматович', 'Хаджанов', 'M', '2006-04-18', 'Холост', 0, 'Уборщик', 'Среднее профессиональное орбазование', 6, 3, 15000, '55547645754', 'fghjklmjhgdfsdas@mail.com'),
('svyatoslav', 'user', 'Святослав', 'Сергеевич', 'Несинов', 'M', '1998-07-13', 'Холост', 0, 'Физик', 'Среднее профессиональное орбазование', 7, 0, 15000, '12345678965', 'qwerty@mail.com'),
('daniil', 'user', 'Даниил', 'Владимирович', 'Витков', 'M', '1995-02-28', 'Женат', 0, 'Профессор', 'Среднее профессиональное орбазование', 9, 0, 30000, '14327654776', 'q1w2e3r4t5y6@mail.ru'),
('georgiy', 'user', 'Георгий', 'Артемович', 'Крючихин', 'M', '1984-12-02', 'Холост', 0, 'Математик', 'Среднее профессиональное орбазование', 7, 13, 29000, '43654765867', 'sdgfxdhjfm@mail.com'),
('egor', 'user', 'Егор', 'Андреевич', 'Лукьянов', 'M', '1990-01-17', 'Женат', 3, 'Математик', 'Среднее профессиональное образование', 8, 9, 19242, '32545756868', 'dgjf@ljhl.ru'),
('dim4ik', 'user', 'Дмитрий', 'Сергеевич', 'Корабельников', 'М', '1962-05-29', 'Женат', 5, 'Математик', 'Среднее профессиональное орбазование', 8, 19, 190242, '2352352353', 'dimaaa@ljhl.ru'),
('armyan', 'user', 'Артур', 'Давидович', 'Петросян', 'М', '1990-11-02', 'Холост', 0, 'Физик', 'Аспирант', 8, 6, 89567, '1234567890', 'armenia@ljhl.ru'),
('kazahDanya', 'user', 'Даниель', 'Андреевич', 'Ни', 'М', '2006-03-04', 'Холост', 0, 'Лаборант', 'Аспирант', 9, 1, 63656, '7777343234', 'dcb@ljhl.ru'),
('glist29', 'user', 'Даниил', 'Олегович', 'Сатюков', 'М', '2005-04-29', 'Женат', 0, 'Уборщик', 'Начальное общее образование', 9, 1, 3000, '6666777777', 'glista@ljhl.ru'),
('qra', 'admin', 'Данила', 'Александрович', 'Демидов', 'М', '1990-12-17', 'Холост', 0, 'Директор', 'Среднее профессиональное орбазование', 9, 24, 300000, '999999999', 'qra@ljhl.ru'),
('vasya', 'user', 'Василиса', 'Андреевна', 'Бочнюк', 'Ж', '2006-09-04', 'Не замужем', 0, 'Старший научный сотрудник', 'Среднее профессиональное орбазование', 10, 1, 63050, '8888777777', 'vasya@ljhl.ru'),
('nastya', 'user', 'Анастасия', 'Игоревна', 'Егорова', 'Ж', '2000-06-03', 'Замужем', 0, 'Лаборант', 'Среднее профессиональное орбазование', 10, 2, 30000, '1111777777', 'nastya@ljhl.ru'),
('dasha', 'user', 'Дарья', 'Тарасовна', 'Назаренко', 'Ж', '2000-03-06', 'Не замужем', 0, 'Лаборант', 'Среднее профессиональное орбазование', 10, 1, 40000, '2222777777', 'dahs@ljhl.ru'),
('aboba', 'user', 'Абдуджафис', 'Абдурасулович', 'Бободжанов', 'М', '1945-05-09', 'Женат', 6, 'Профессор', 'Доктор наук', 11, 50, 100000, '6666111111', 'abebra@ljhl.ru');

INSERT INTO Projects (ProjTtl, Deadlines, Requirements, Dep_ID)
VALUES 
('Проект по исследованию генома', '2025-01-15', 'Изучение структуры и функций генома.', 3),
('Нанотехнологии в медицине', '2026-06-01', 'Разработка новых методов диагностики.', 4),
('Экологические исследования', '2026-03-01', 'Изучение влияния загрязнения на экосистему.', 5),
('Клинические испытания новых препаратов', '2025-07-01', 'Проведение клинических испытаний.', 6),
('Психофизическое развитие студентов', '2025-09-01', 'Исследование методов физического развития.', 7),
('Инженерия в биоразлагаемых материалах', '2025-05-01', 'Создание новых экоматериалов.', 8),
('Компьютерные технологии в образовании', '2026-11-01', 'Разработка образовательных программ.', 9),
('Физика высоких энергий', '2024-04-01', 'Исследование физических свойств материи.', 10),
('Пищевая безопасность и технологии', '2025-02-01', 'Разработка безопасных пищевых технологий.', 11);

-- INSERT INTO Projects (ProjTtl, Deadlines, Budget, Requirements, Dep_ID, Progress)
-- VALUES
-- ('Биохимические исследования проекта A', '2025-12-31', 500000, 'Исследование новых методов анализа белков', 1, 10),
-- ('Молекулярная биология проекта B', '2025-12-15', 400000, 'Разработка новых молекулярных методов', 2, 20),
-- ('Генетические исследования проекта C', '2026-01-10', 600000, 'Изучение генетических модификаций', 3, 30),
-- ('Нанотехнологии проекта D', '2025-11-30', 700000, 'Разработка новых наноматериалов', 4, 25),
-- ('Клинические испытания проекта E', '2026-02-20', 300000, 'Проведение клинических испытаний новых лекарств', 5, 15),
-- ('Экологические исследования проекта F', '2025-09-05', 250000, 'Изучение влияния изменений климата', 6, 5),
-- ('Психологические исследования проекта G', '2026-03-01', 200000, 'Анализ социальных и психологических факторов', 7, 12),
-- ('Инженерия проекта H', '2025-10-20', 450000, 'Разработка новых инженерных решений', 8, 22),
-- ('Физика и астрономия проекта I', '2026-04-15', 550000, 'Исследование космических явлений', 9, 18),
-- ('Информационные технологии проекта J', '2025-08-30', 650000, 'Разработка нового программного обеспечения', 10, 35),
-- ('Пищевые технологии проекта K', '2025-05-25', 300000, 'Исследование новых пищевых продуктов', 11, 10);

-- Заполнение таблицы tasks
INSERT INTO tasks (Id_Employee, Task, Progress) VALUES
(1, 'Изучить методы анализа белков', 50),
(2, 'Подготовить материалы для уборки', 100),
(3, 'Провести эксперименты по молекулярной биологии', 30),
(4, 'Подготовить отчет по проекту', 70),
(5, 'Собрать данные для исследования', 60),
(6, 'Разработать план клинических испытаний', 20),
(7, 'Составить список необходимых материалов', 40),
(8, 'Анализировать результаты экологических исследований', 80),
(9, 'Исследовать наноматериалы', 90),
(10, 'Провести анализ физических свойств', 10);

-- Заполнение таблицы article
INSERT INTO article (title, HtmlLink, completed, author_id) VALUES
('Основы молекулярной биологии', 'http://localhost:3002/uploads/articles/1728371269_article.html', TRUE, 3),
('Пример статьи 1', 'http://localhost:3002/uploads/articles/1728375121_article.html', TRUE, 3),
('Пример статьи 2', 'http://localhost:3002/uploads/articles/1728378982_article.html', TRUE, 1),
-- ('Пример статьи 3', 'http://localhost:3002/uploads/articles/1728379116_article.html', TRUE, 3),
('Экологические исследования в России', 'http://localhost:3002/uploads/articles/1728374400_article.html', TRUE, 5);

-- Заполнение таблицы article_tags
-- INSERT INTO article_tags (article_id, biology, chemistry, it, physics) VALUES
-- (1, TRUE, FALSE, FALSE, TRUE),
-- (2, TRUE, TRUE, FALSE, FALSE);

-- Заполнение таблицы article_comms
-- INSERT INTO article_comms (article_id, author_id, comm) VALUES
-- (1, 2, 'Отличная статья!'),
-- (1, 1, 'Нужны дополнительные исследования.'),
-- (1, 4, 'Хорошая работа, но требуется больше данных.'),
-- (2, 5, 'Интересная тема, хотелось бы узнать больше.'),
-- (2, 3, 'Хорошие идеи для дальнейших исследований.');

-- Заполнение таблицы chats
INSERT INTO chats (title) VALUES
('Научные исследования'),
('Обсуждение проектов'),
('Вопросы и ответы по биологии'),
('Клинические испытания');

-- Заполнение таблицы chat_users
INSERT INTO chat_users (user_id, chat_id) VALUES
(1, 1),
(2, 1),
(3, 2),
(4, 3),
(5, 4),
(6, 1),
(7, 2),
(8, 3),
(9, 4),
(10, 1);

-- Заполнение таблицы chat_msgs
INSERT INTO chat_msgs (chat_id, sender_id, msg, pinned) VALUES
(1, 1, 'Кто готов обсудить новые исследования?', FALSE),
(1, 2, 'Я готов!', TRUE),
(2, 3, 'Как продвигается проект?', FALSE),
(3, 4, 'Есть вопросы по молекулярной биологии.', FALSE),
(4, 5, 'Когда следующий семинар?', TRUE);

-- Заполнение таблицы msg_media
-- INSERT INTO msg_media (msg_id, file_link) VALUES
-- (1, 'http://example.com/media1'),
-- (2, 'http://example.com/media2'),
-- (3, 'http://example.com/media3');

-- Заполнение таблицы fav_articles
-- INSERT INTO fav_articles (art_id, user_id) VALUES
-- (1, 1),
-- (1, 3),
-- (2, 4),
-- (2, 5),
-- (2, 1);

SET SQL_SAFE_UPDATES = 0;

UPDATE USERS SET Pass = '$2b$10$0MYFAuj1UsW19nk.u9AlfOAIidlQeGFgrJNW9UV6o1Pf.tsvAWAjm';

SET SQL_SAFE_UPDATES = 1;